app/views/users/show.html.erb

SELECT "secrets".* FROM "secrets" INNER JOIN "likes" ON "secrets"."id" = "likes"."secret_id" WHERE "likes"."user_id" = $1 GROUP BY "secrets"."id"  ORDER BY "secrets"."id" ASC  [["user_id", 2]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."secret_id" = $1  [["secret_id", 8]]
---
<h3>Secrets:</h3>
<% @user.secrets.each do |secret| %>
	<p><%= secret.content %></p>
	<p><%= secret.likes.count %> likes</p>