app/views/secrets/index.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."secret_id" = $1  [["secret_id", 8]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."secret_id" = $1  [["secret_id", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."secret_id" = $1 AND "users"."id" = $2 LIMIT 1  [["secret_id", 1], ["id", 2]]
SELECT "likes"."id" FROM "likes" WHERE "likes"."user_id" = 6 AND "likes"."secret_id" = 1
---
  <p><%= secret.content %></p>
  <p><%= secret.likes.count %> likes</p>
  <% if secret.users_liked.include?(current_user) %>