app/controllers/likes_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
  def create
    idea=Idea.find(params[:id])
    if !idea.users_liked.include?(current_user)