app/controllers/likes_controller.rb

SELECT  "secrets".* FROM "secrets" WHERE "secrets"."id" = $1 LIMIT 1  [["id", 8]]
INSERT INTO "likes" ("user_id", "secret_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["secret_id", 8], ["created_at", "2015-07-21 04:20:37.973820"], ["updated_at", "2015-07-21 04:20:37.973820"]]
---
	def create
		secret=Secret.find(params[:secret_id])
		# like=secret.likes.new(user_id:current_user.id)
		likes = Like.new(user:current_user, secret_id:params[:secret_id])
		if likes.valid?
			likes.save

DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 19]]
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT 1  [["id", 19]]
---
	def destroy
		Secret.find(params[:id]).likes.last.delete