app/controllers/secrets_controller.rb

  def index
  	@secrets = Secret.all
---
SELECT "secrets".* FROM "secrets"

  def create
  	puts "in Secrets create method..........."
  	User.find(session[:user_id]).secrets.create(content:params[:New_Secret])
---
INSERT INTO "secrets" ("user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["content", "{\"content\"=>\"Work hard play hard\"}"], ["created_at", "2015-07-20 08:11:01.555684"], ["updated_at", "2015-07-20 08:11:01.555684"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]

  def destroy
  	secret = Secret.find(params[:id])
    secret.destroy if secret.user == current_user
---
SELECT  "secrets".* FROM "secrets" WHERE "secrets"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "secrets" WHERE "secrets"."id" = $1  [["id", 2]]