app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.valid?
      puts "...user valid"
      user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def show
    puts "***************in users show method damn it!!!!!!!! *******"
    puts "users show params[:id] = #{params[:id]}"
    id = params[:id]
    @user = User.find(id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    id = params[:id]
    @user = User.find(id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    id = params[:id]
    @user = User.find(id)
    if params[:name]
      @user.update_attribute(:name, params[:name])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "drake"], ["updated_at", "2015-07-20 03:05:00.619035"], ["id", 1]]

  def destroy
    puts "***destroying user***"
    id = params[:id]
    User.find(id).delete
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]